In [1]:
import pandas as pd

## 예제 2-12 데이터를 읽어오기

In [3]:
ct = pd.read_csv("../data/2017_college_tuition.csv",encoding='euc-kr')

In [4]:
ct.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [5]:
ct.tail()

         학교명 설립구분  평균등록금
191    호남대학교   사립   6482
192  호남신학대학교   사립   6438
193    호서대학교   사립   7695
194    호원대학교   사립   6929
195    홍익대학교   사립   8297

In [7]:
ct.shape

(196, 3)

In [8]:
ct.columns

Index(['학교명', '설립구분', '평균등록금'], dtype='object')

## 예제 2-13 대괄호를 이용한 일반 검색

In [9]:
ct_ser = ct['학교명']

In [10]:
ct_ser.head()

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

In [11]:
ct_ser[0]

'강릉원주대학교'

In [12]:
ct_ser[100]

'부산장신대학교'

In [13]:
ct_ser.__getitem__(100)

'부산장신대학교'

In [15]:
ct.__getitem__('학교명').head()

0      강릉원주대학교
1        강원대학교
2    경남과학기술대학교
3        경북대학교
4        경상대학교
Name: 학교명, dtype: object

## 예제 2-14 대괄호를 이용한 슬라이스 검색

In [16]:
ct_ser[10:20]

10      금오공과대학교
11      대구교육대학교
12        목포대학교
13      목포해양대학교
14        부경대학교
15      부산교육대학교
16        부산대학교
17    서울과학기술대학교
18      서울교육대학교
19        서울대학교
Name: 학교명, dtype: object

In [17]:
ct_slice = ct[10:20]

In [18]:
ct_slice

          학교명 설립구분  평균등록금
10    금오공과대학교  국공립   3769
11    대구교육대학교  국공립   3604
12      목포대학교  국공립   3895
13    목포해양대학교  국공립   3424
14      부경대학교  국공립   4042
15    부산교육대학교  국공립   3024
16      부산대학교  국공립   4325
17  서울과학기술대학교  국공립   5405
18    서울교육대학교  국공립   3088
19      서울대학교  국공립   5962

In [19]:
ct_slice.head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042

In [20]:
ct_slice.shape

(10, 3)

In [21]:
ct.__getitem__(slice(10,20)).head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042

## 예제 2-15 논리식 검색

In [22]:
sat = pd.read_csv("../data/2014_korea_sat_scores.csv",encoding='euc-kr').dropna(axis=1)

In [23]:
type(sat)

pandas.core.frame.DataFrame

In [24]:
sat.head()

   등급     과목 구분점수  도수(명)  비율(%)
0   1  국어 A형  128  13866   4.30
1   2  국어 A형  123  23599   7.32
2   3  국어 A형  116  42470  13.17
3   4  국어 A형  108  52640  16.32
4   5  국어 A형   97  63896  19.81

In [25]:
sat.shape

(342, 5)

In [26]:
sat['도수(명)'].dtype

dtype('int64')

In [27]:
import numpy as np

In [28]:
sat['도수(명)']

0      13866
1      23599
2      42470
3      52640
4      63896
       ...
337     1324
338     1075
339      873
340      233
341      216
Name: 도수(명), Length: 342, dtype: int64

In [29]:
type(sat['도수(명)'])

pandas.core.series.Series

In [31]:
(sat['도수(명)'] < 20000)

0       True
1      False
2      False
3      False
4      False
       ...
337     True
338     True
339     True
340     True
341     True
Name: 도수(명), Length: 342, dtype: bool

In [32]:
# 위 논리식의 결과를 인덱스 검색에 넣으면 True인 행만 추출

In [33]:
sat[sat['도수(명)'] < 20000]

     등급     과목  구분점수  도수(명)  비율(%)
0     1  국어 A형   128  13866   4.30
8     9  국어 A형  60미만  12554   3.89
9     1  국어 B형   127  12615   4.45
16    8  국어 B형    59  19943   7.03
17    9  국어 B형  59미만  10868   3.83
..   ..    ...   ...    ...    ...
337   5    한문Ⅰ    45   1324  20.92
338   6    한문Ⅰ    42   1075  16.99
339   7    한문Ⅰ    39    873  13.79
340   8    한문Ⅰ    37    233   3.68
341   9    한문Ⅰ  37미만    216   3.41

[294 rows x 5 columns]

## 예제 2-16 다중 논리식 검색

In [34]:
l_sat = ((sat['도수(명)'] < 20000) & (sat['비율(%)'] <= 5.0))

In [35]:
l_sat.shape

(342,)

In [37]:
l_sat

0       True
1      False
2      False
3      False
4      False
       ...
337    False
338    False
339    False
340     True
341     True
Length: 342, dtype: bool

In [ ]:
# True 갯수의 총합

In [38]:
l_sat.sum()

71

In [39]:
sat_logic = sat[l_sat]

In [40]:
sat_logic.shape

(71, 5)

In [41]:
sat_logic

     등급       과목  구분점수  도수(명)  비율(%)
0     1    국어 A형   128  13866   4.30
8     9    국어 A형  60미만  12554   3.89
9     1    국어 B형   127  12615   4.45
17    9    국어 B형  59미만  10868   3.83
18    1    수학 A형   137  19675   4.77
..   ..      ...   ...    ...    ...
323   9     아랍어Ⅰ  41미만    322   3.23
324   1  기초 베트남어    81    953   4.17
332   9  기초 베트남어  40미만    630   2.76
340   8      한문Ⅰ    37    233   3.68
341   9      한문Ⅰ  37미만    216   3.41

[71 rows x 5 columns]

## 예제 2-17 시리즈에 논리식 검색

In [42]:
sat_ser = sat['도수(명)']

In [43]:
sat_ser

0      13866
1      23599
2      42470
3      52640
4      63896
       ...
337     1324
338     1075
339      873
340      233
341      216
Name: 도수(명), Length: 342, dtype: int64

In [44]:
# 논리 검색은 시리즈에서도 DataFrame과 마찬가지로 적용된다.

In [45]:
sat_ser[sat_ser < 20000]

0      13866
8      12554
9      12615
16     19943
17     10868
       ...
337     1324
338     1075
339      873
340      233
341      216
Name: 도수(명), Length: 294, dtype: int64

In [46]:
sat_ser[sat_ser < 20000].shape

(294,)

In [47]:
sat_ser[sat_ser < 20000].head()

0     13866
8     12554
9     12615
16    19943
17    10868
Name: 도수(명), dtype: int64

## 예제 2-18 데이터 프레임 팬시검색

In [48]:
#팬시 검색 : 특정 레이블을 직접 리스트에 넣어서 검색하는 방식

In [49]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [50]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [51]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [52]:
# 필터링하고 싶은 열을 직접 리스트에 입력

In [53]:
titanic[['age', 'sex', 'alive']].head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

In [54]:
titanic[['age', 'sex', 'alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [55]:
# 팬시 검색을 하면 하나의 열도 데이터 프레임으로 반환

In [56]:
titanic[['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [57]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [58]:
# 검색에 열 문자열만 입력하면 시리즈로 반환

In [59]:
type(titanic['age'])

pandas.core.series.Series

## 예제 2-19 시리즈 팬시검색

In [60]:
titanic_age = titanic['age']

In [61]:
titanic_age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [62]:
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64

## 예제 2-20 명시적 인덱서 검색

In [63]:
diamonds = sns.load_dataset('diamonds')

In [64]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [65]:
diamonds.shape

(53940, 10)

In [66]:
diamonds.isnull().sum()

carat      0
cut        0
color      0
clarity    0
depth      0
table      0
price      0
x          0
y          0
z          0
dtype: int64

In [68]:
type(diamonds.loc)

pandas.core.indexing._LocIndexer

In [70]:
diamonds.loc[0, 'carat']

0.23

In [71]:
diamonds.loc[:, 'carat']

0        0.23
1        0.21
2        0.23
3        0.29
4        0.31
         ...
53935    0.72
53936    0.72
53937    0.70
53938    0.86
53939    0.75
Name: carat, Length: 53940, dtype: float64

In [73]:
diamonds['carat']

0        0.23
1        0.21
2        0.23
3        0.29
4        0.31
         ...
53935    0.72
53936    0.72
53937    0.70
53938    0.86
53939    0.75
Name: carat, Length: 53940, dtype: float64

In [74]:
# 펜시 검색을 통해 데이터 프레임으로 반환

In [75]:
diamonds.loc[:, ['carat']]

       carat
0       0.23
1       0.21
2       0.23
3       0.29
4       0.31
...      ...
53935   0.72
53936   0.72
53937   0.70
53938   0.86
53939   0.75

[53940 rows x 1 columns]

In [76]:
# 펜시 검색을 열 검색 조건임

In [78]:
diamonds[['carat']]

       carat
0       0.23
1       0.21
2       0.23
3       0.29
4       0.31
...      ...
53935   0.72
53936   0.72
53937   0.70
53938   0.86
53939   0.75

[53940 rows x 1 columns]

In [79]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75